MAVProxyUser/MITCheetahSTM31MP1-Claude/robot/src/Stm32mp1HardwareBridge.cpp
/*!
 * @file Stm32mp1HardwareBridge.cpp
 * @brief Headless hardware bridge for the Octavo OSD32MP1 port. See the header.
 */
// portable: BSD sockets + pthreads (Linux-only pieces are guarded inline)

#include "Controllers/LegController.h"
#include "Stm32mp1HardwareBridge.h"

#ifdef __linux__
#include <sched.h>
#include <sys/mman.h>
#endif
#include <unistd.h>
#include <cstdio>
#include <cstring>
#include <cstdlib>
#include <cmath>
#include <stdexcept>
#include <thread>

#include "rt/rt_rc_interface.h"
#include "Math/orientation_tools.h"
#include "../../gazebo/ShmTrace.h"   // per-tick/text SHM tracing - see that file's own header

// Defined in RobotRunner.cpp; suspends the z-collapse fall check around
// known-safe low-height windows (see the sequencer thread below and
// mit_sim_main.cpp's dash interlude, which already uses the same function).
void setFallZEnable(bool on);

// The SpineBoard structs and the LCM POD structs must be layout-identical for the
// memcpy bridge below to be valid.
static_assert(sizeof(SpiCommand) == sizeof(spi_command_t), "SpiCommand layout mismatch");
static_assert(sizeof(SpiData)    == sizeof(spi_data_t),    "SpiData layout mismatch");

/*!
 * Headless port has no RC. RobotRunner calls this every step; we report "no RC"
 * (all zero -> mode 0). This is ignored because use_rc is 0 in the port config.
 * Defined here so the SBUS/serial chain (which needs <stropts.h>) is not compiled.
 */
void get_rc_control_settings(void* settings) {
  memset(settings, 0, sizeof(rc_control_settings));
}

// The RC chain (rt_rc_interface.cpp) normally defines this global; the MIT
// FSM references it via `extern rc_control_settings rc_control`. Headless port
// has no RC, so provide a zeroed instance.
rc_control_settings rc_control;

Stm32mp1HardwareBridge::Stm32mp1HardwareBridge(RobotController* controller,
                                               std::string robot_yaml,
                                               std::string user_yaml,
                                               Backend backend)
    : _controller(controller), _robotYaml(robot_yaml), _userYaml(user_yaml),
      _backend(backend) {
  _userControlParameters = controller->getUserControlParameters();
#ifdef __linux__
  _unitreeCfg = unitree_default_config();   // A1, 4 buses; override before run() as needed
#endif
  // _canImuCfg defaults: can0, node 124, msgs 20500/20501
  memset(&_spiData, 0, sizeof(_spiData));
  memset(&_spiCommand, 0, sizeof(_spiCommand));
  // Spawn yaw from the env, CORRECT FROM TICK 1 - see the field's comment
  // in the header for the measured engagement tip this closes now that
  // velocity aiding defaults on. Same compass->Gazebo-yaw conversion
  // mit_sim_main uses (world_yaw = pi/2 - bearing), same env var server.py
  // already passes; unset = 0 deg = the old north-spawn behaviour exactly.
  if (const char* sb = getenv("WP_SPAWN_BEARING_DEG"))
    _spawnYawRad = 1.5707963f - (float)(atof(sb) * M_PI / 180.0);
  // Zero the operator command channel. It was left uninitialised, so the
  // waypoint driver's "wait until the sequencer has ramped the stick to SIM_VX"
  // gate saw garbage that already exceeded the target and took the stick at
  // t=0 - before the robot had even stood up, which spun it 170 degrees off
  // heading. An uninitialised stick is worse than a bug in sim: on hardware it
  // is a velocity command nobody asked for.
  memset(&_gamepadCommand, 0, sizeof(_gamepadCommand));
  memset(&_utCmd, 0, sizeof(_utCmd));
  memset(&_utData, 0, sizeof(_utData));
}

void Stm32mp1HardwareBridge::setupScheduler() {
  // Best-effort real-time. On the board run as root for this to take effect;
  // during bring-up we warn and continue rather than abort.
#ifdef __linux__
  if (mlockall(MCL_CURRENT | MCL_FUTURE) == -1)
    shmtrace::logf(0.0, "[stm32mp1] mlockall failed (run as root for RT determinism); continuing");
  struct sched_param params;
  params.sched_priority = 49;
  if (sched_setscheduler(0, SCHED_FIFO, &params) == -1)
    shmtrace::logf(0.0, "[stm32mp1] SCHED_FIFO failed (run as root for RT determinism); continuing");
#else
  shmtrace::logf(0.0, "[stm32mp1] host build: default scheduling (no mlockall/SCHED_FIFO)");
#endif
}

void Stm32mp1HardwareBridge::initHardware() {
  if (_backend == Backend::GAZEBO) {
    shmtrace::logf(0.0, "[stm32mp1] backend: GAZEBO (UDP to %s cmd:%d sensor:%d)",
           _gazeboCfg.peer_addr, _gazeboCfg.cmd_port, _gazeboCfg.sensor_port);
    if (init_gazebo(_gazeboCfg, &_vectorNavData) != 0)
      shmtrace::logf(0.0, "[stm32mp1] Gazebo UDP init failed");
    return;
  }
  shmtrace::logf(0.0, "[stm32mp1] init CAN IMU (%s node %d)", _canImuCfg.interface, _canImuCfg.imu_node_id);
#ifdef __linux__
  if (init_can_imu(_canImuCfg, &_vectorNavData) != 0)
#else
  shmtrace::logf(0.0, "[stm32mp1] HARDWARE backend (CAN IMU) is Linux-only"); exit(1);
#endif
    shmtrace::logf(0.0, "[stm32mp1] CAN IMU init failed; estimator will run on a stale/identity IMU");

  shmtrace::logf(0.0, "[stm32mp1] init Unitree RS485 (%d bus(es))", _unitreeCfg.num_buses);
  if (init_unitree(_unitreeCfg) != 0)
    shmtrace::logf(0.0, "[stm32mp1] Unitree RS485 init failed; motors will not respond");
}

void Stm32mp1HardwareBridge::runMotors() {
  // RobotRunner has written _spiCommand; ship it and read back _spiData.
  // SpiCommand/spi_command_t (and SpiData/spi_data_t) are layout-identical (asserted above).
  memcpy(&_utCmd, &_spiCommand, sizeof(_utCmd));
  if (_backend == Backend::GAZEBO) {
    gazebo_send_receive(&_utCmd, &_utData);
    // GROUND TRUTH, FOR INSTRUMENTATION ONLY. `cheater_mode` is now hard-zero
    // (see the note in init) and no estimator consumes this struct, so nothing
    // here reaches the control loop. It exists so [ESTERR] can report how far
    // the LinearKF is from reality - the estimator gap is this port's measured
    // speed wall, and you cannot close a gap you refuse to measure.
    // MIT quat order is (w,x,y,z); vBody = rBody * vWorld with rBody = world->body.
    {
      SimTruth t;
      gazebo_get_truth(&t);
      Quat<double> q;
      q << t.quat[3], t.quat[0], t.quat[1], t.quat[2];
      _cheaterState.orientation = q;
      _cheaterState.position << t.pos[0], t.pos[1], t.pos[2];
      Vec3<double> vWorld(t.vworld[0], t.vworld[1], t.vworld[2]);
      _cheaterState.vBody = ori::quaternionToRotationMatrix(q) * vWorld;
      _cheaterState.omegaBody << _vectorNavData.gyro[0], _vectorNavData.gyro[1],
          _vectorNavData.gyro[2];
      _cheaterState.acceleration << _vectorNavData.accelerometer[0],
          _vectorNavData.accelerometer[1], _vectorNavData.accelerometer[2];
    }
    // ---- ABSOLUTE POSITION AIDING (baro / GPS) ---------------------------
    // MIT's KF fuses IMU with LEG ODOMETRY, which is weighted per foot by a
    // contact trust that goes to zero in swing - so an all-swing window leaves
    // position with no measurement at all and the covariance diverges. Baro and
    // GPS are absolute and contact-independent, so they bound that drift. Same
    // sensors the real dog gets over CAN; here they come over UDP.
    // Opt-in ($SIM_ABS_AIDING=1) so existing measurements are unaffected.
    {
      // POSITION AIDING REMOVED 2026-08-29 (OPEN-13): measured net-harmful
      // to locomotion and now permanently off. Baro/GPS position is not a
      // control-loop input on this robot - the controller needs consistent
      // RELATIVE motion to balance, and injecting absolute position steps
      // the tracking error and the MPC fights it. Measured: no aiding
      // 20.68/21.35/21.12/25.24/21.30 m, GPS aiding
      // 25.51/21.33/0.25/19.13 - same mean, catastrophic tail. Absolute
      // position belongs in the NAVIGATION layer, which is where
      // WaypointNav already reads it (gazebo_get_aux directly). VELOCITY
      // aiding is a different measurement with a different justification
      // and stays - see the block below.
      static const bool aidOn = false;
      // Independent of aidOn on purpose - see the velocity block below.
      // DEFAULT ON as of 2026-08-28 ($SIM_VEL_AIDING=0 disables). The
      // history matters: this feature was built for exactly the failure it
      // now fixes, then mis-evaluated for a whole session because the
      // x_comp_integral windup was corrupting every test of it (the robot
      // was being commanded backward; the estimator faithfully reported a
      // robot going nowhere and aiding got blamed). With the windup fixed,
      // measured cleanly: galloping's leg odometry reads ~8-10% LOW during
      // confident stance (the raw measurement itself, not the KF blend -
      // discriminated with $SIM_LEGVEL_DBG: raw-meas/fused=1.02 while
      // fused/truth=0.917), the signature of foot slip / schedule mismatch
      // under a 40%-flight gait. GPS velocity aiding closes it to 0.5%
      // (fused/truth 0.995) and costs symmetric gaits nothing (trotting
      // dash with aiding: PASS, scale 0.994). The NEO-M9V this sim's GPS
      // is modeled on genuinely outputs Doppler velocity at 50 Hz, so this
      // is realistic sensor fusion, not a sim-only crutch.
      static const bool velAidOn = !getenv("SIM_VEL_AIDING") ||
                                   atoi(getenv("SIM_VEL_AIDING")) != 0;
      if (aidOn || velAidOn) {
        SimAuxSensors aux;
        gazebo_get_aux(&aux);
        static bool  originSet = false;
        static double lat0 = 0, lon0 = 0, mPerDegLon = 0;
        static float  baro0 = 0;
        static float  estOffX = 0, estOffY = 0, estOffZ = 0.08f;
        if (aidOn && !originSet && aux.gps_lat != 0.0) {
          lat0 = aux.gps_lat; lon0 = aux.gps_lon; baro0 = aux.baro_alt;
          mPerDegLon = 111320.0 * std::cos(lat0 * M_PI / 180.0);
          // FRAME ALIGNMENT. The estimator's position origin is the robot's
          // pose at spawn; the GPS origin is wherever it happens to be at the
          // FIRST FIX, which is later - after stand-up has already moved it. If
          // the two are not aligned, the aiding corrects toward a systematically
          // wrong reference, and the gentler the gain the more relentlessly it
          // drags the estimate into that bias. Measured exactly that: aiding off
          // 20.68 m, low-gain 5.78 m, gentlest (tau=10 s) 0.20 m - harm growing
          // as the correction got softer, which is the signature of a bias
          // rather than noise. Record where the estimator thinks it is at the
          // moment the GPS origin is captured, and carry that as the offset.
          if (_robotRunner) {
            const auto& est = _robotRunner->getStateEstimate();
            estOffX = est.position[0];
            estOffY = est.position[1];
            estOffZ = est.position[2];
          }
          originSet = true;
          shmtrace::logf(0.0, "[stm32mp1] abs aiding: origin lat=%.7f lon=%.7f baro=%.2f m",
                 lat0, lon0, baro0);
        }
        if (aidOn && originSet) {
          // Equirectangular projection about the origin, same as WaypointNav.
          // Gazebo world is ENU: x = East, y = North, z = up.
          const float north = (float)((aux.gps_lat - lat0) * 111320.0);
          const float east  = (float)((aux.gps_lon - lon0) * mPerDegLon);
          // Baro is referenced to its own value at spawn, plus the height the
          // robot actually starts at (belly on the deck).
          const float z = (aux.baro_alt - baro0) + estOffZ;
          _absAiding.position << east + estOffX, north + estOffY, z;
          _absAiding.haveXY = true;
          _absAiding.haveZ  = true;
          // 1-sigma. Baro is ~0.08 m here, far coarser than the 2-5 cm a gait
          // moves the body - it bounds drift, it does not track the bounce.
          const float gps_sig  = getenv("SIM_GPS_SIGMA")
                               ? atof(getenv("SIM_GPS_SIGMA")) : 0.5f;
          const float baro_sig = getenv("SIM_BARO_SIGMA")
                               ? atof(getenv("SIM_BARO_SIGMA")) : 0.10f;
          _absAiding.sigma << gps_sig, gps_sig, baro_sig;
        }
        // ---- GPS VELOCITY AIDING ($SIM_VEL_AIDING=1), independent opt-in ---
        // Separate flag from SIM_ABS_AIDING above: this corrects the KF's
        // VELOCITY estimate, not position, and the two have different (and
        // previously separately-measured) risk profiles - see the comment on
        // AbsolutePositionAiding::haveVel. Does NOT need the lat/lon origin
        // capture above - velocity is already in the right UNITS directly
        // from the sensor, no reference point needed - but it DOES need a
        // FRAME rotation, which the first cut of this code got wrong: it
        // assumed the KF's x/y ARE world east/north, which is only true
        // when spawn yaw is exactly zero. VectorNavOrientationEstimator
        // zeroes yaw to the robot's OWN spawn heading on tick one (see
        // OrientationEstimator.cpp), so the KF's internal frame is world
        // frame rotated by -spawn_yaw, confirmed directly against
        // $SIM_ESTERR ground truth on a north-spawning mission (see
        // CLAUDE.md "GPS VELOCITY AIDING" for the derivation and the one
        // validated data point - spawn_yaw=90deg). Rotate the world-frame
        // (east, north) GPS velocity into the KF's frame before injecting:
        // ex = ve*cos(yaw) + vn*sin(yaw), ey = -ve*sin(yaw) + vn*cos(yaw).
        // Numerically checked against the one validated data point (yaw=90
        // deg, pure-north world velocity (ve=0,vn=1) must map to pure
        // estimator-x (ex=1,ey=0)) before trusting it in code - an earlier
        // draft of this exact formula had the cross-term signs backwards
        // and would have injected the rotation in the wrong direction.
        // STALENESS GATE. The world SDF configures the navsat sensor at
        // update_rate=10 Hz (make_world.py) against a 500 Hz control loop -
        // a 50x mismatch. Without this gate, the block below ran every
        // tick regardless, applying a full Kalman correction toward the
        // SAME zero-order-held GPS reading ~49 times out of every 50 -
        // effectively treating one real measurement as 50 independent
        // ones, over-weighting it by 50x versus what the filter's own R
        // (measurement noise) was tuned to assume. Gate on the reading
        // actually changing (exact float equality is the right test here,
        // not a fragile epsilon - a genuinely stale ZOH value is bit-for-
        // bit identical to the previous tick's, not merely close).
        static float lastGpsVel[3] = {0, 0, 0};
        const bool gpsVelIsNew = velAidOn &&
            (aux.gps_vel[0] != lastGpsVel[0] || aux.gps_vel[1] != lastGpsVel[1] ||
             aux.gps_vel[2] != lastGpsVel[2]);
        if (velAidOn) {
          lastGpsVel[0] = aux.gps_vel[0];
          lastGpsVel[1] = aux.gps_vel[1];
          lastGpsVel[2] = aux.gps_vel[2];
        }
        if (velAidOn && gpsVelIsNew) {
          // aux.gps_vel is NED (north, east, down); world-frame east/north:
          const float ve = aux.gps_vel[1], vn = aux.gps_vel[0];
          const float c = std::cos(_spawnYawRad), s = std::sin(_spawnYawRad);
          const float ex = ve * c + vn * s;
          const float ey = -ve * s + vn * c;
          _absAiding.velocity << ex, ey, -aux.gps_vel[2];
          _absAiding.haveVel = true;
          // 0.02 = the measured point of diminishing returns from the
          // sigma sweep (0.1 -> 24.9m progress, 0.02 -> 54.5m, 0.005 ->
          // 53.7m in the windup era; post-fix, 0.02 is the value the 0.5%
          // scale closure was measured at).
          const float vel_sig = getenv("SIM_GPS_VEL_SIGMA")
                              ? atof(getenv("SIM_GPS_VEL_SIGMA")) : 0.02f;
          _absAiding.velSigma << vel_sig, vel_sig, vel_sig;
        } else if (velAidOn) {
          // Must explicitly clear this every stale tick, not just skip
          // setting it - haveVel is a persistent member (_absAiding lives
          // for the process lifetime), so without this it would stay true
          // from the last genuinely-new sample and the estimator would
          // keep correcting against a value that never actually changed,
          // which is the exact bug this whole gate exists to close.
          _absAiding.haveVel = false;
        }
      }
    }
  } else {
#ifdef __linux__
    unitree_send_receive(&_utCmd, &_utData);
#else
    shmtrace::logf(0.0, "[stm32mp1] HARDWARE backend is Linux-only"); exit(1);
#endif
  }
  memcpy(&_spiData, &_utData, sizeof(_spiData));
}

