MAVProxyUser/MITCheetahSTM31MP1-Claude/robot/src/Stm32mp1HardwareBridge.cpp
void Stm32mp1HardwareBridge::run() {
  setupScheduler();
  initHardware();

  shmtrace::logf(0.0, "[stm32mp1] loading robot parameters from %s", _robotYaml.c_str());
  try {
    _robotParams.initializeFromYamlFile(_robotYaml);
  } catch (std::exception& e) {
    shmtrace::logf(0.0, "[stm32mp1] robot yaml failed: %s", e.what());
    exit(1);
  }
  if (!_robotParams.isFullyInitialized()) {
    shmtrace::logf(0.0, "[stm32mp1] robot parameters incomplete in %s", _robotYaml.c_str());
    exit(1);
  }

  if (_userControlParameters) {
    shmtrace::logf(0.0, "[stm32mp1] loading user parameters from %s", _userYaml.c_str());
    try {
      _userControlParameters->initializeFromYamlFile(_userYaml);
    } catch (std::exception& e) {
      shmtrace::logf(0.0, "[stm32mp1] user yaml failed: %s", e.what());
      exit(1);
    }
    if (!_userControlParameters->isFullyInitialized()) {
      shmtrace::logf(0.0, "[stm32mp1] user parameters incomplete in %s", _userYaml.c_str());
      exit(1);
    }
  }

  shmtrace::logf(0.0, "[stm32mp1] parameters loaded; starting control");

  _robotRunner = new RobotRunner(_controller, &_taskManager,
                                 _robotParams.controller_dt, "robot-control");
  _robotRunner->driverCommand = &_gamepadCommand;
  _robotRunner->spiData = &_spiData;
  _robotRunner->spiCommand = &_spiCommand;
  _robotRunner->robotType = RobotType::MINI_CHEETAH;   // Unitree legs mapped onto the MC model for now
  _robotRunner->vectorNavData = &_vectorNavData;
  _robotRunner->cheaterState = &_cheaterState;
  // THE REAL BUG BEHIND TONIGHT'S "velocity aiding does nothing" RESULTS:
  // this wiring was gated on SIM_ABS_AIDING alone. Every $SIM_VEL_AIDING=1
  // test run tonight (frame-mismatch fix, then the GPS-rate staleness gate
  // on top of it) produced byte-for-byte identical divergence to the
  // unfixed baseline - which in hindsight was the tell that the mechanism
  // was never actually running at all, not that the fixes were ineffective.
  // this->_robotRunner->absAiding stayed null, so
  // PositionVelocityEstimator's `if (aid && aid->haveVel)` never even
  // evaluated true. Both flags now wire the pointer independently.
  // Velocity aiding now DEFAULTS ON (see the velAidOn comment above), so
  // the pointer must be wired unless it is explicitly disabled - the old
  // "wire only when the variable is set" condition would leave absAiding
  // null on a default launch, silently reproducing the exact
  // disconnected-pointer bug this comment block documents.
  // ($SIM_ABS_AIDING was removed with position aiding itself - OPEN-13.
  // Only velocity aiding remains, and it defaults ON.)
  if (!getenv("SIM_VEL_AIDING") || atoi(getenv("SIM_VEL_AIDING")) != 0)
  {  _robotRunner->absAiding = &_absAiding;
     shmtrace::logf(0.0, "[stm32mp1] absAiding wired: %p", (void*)&_absAiding); }
  // CHEATER MODE IS DELETED. There is no environment variable, no yaml key and
  // no code path that can feed sim ground truth into the state estimator. It is
  // gone deliberately, because merely FIXING it twice did not stop it being used:
  //   1. getenv("SIM_CHEATER") is non-null for "0", so SIM_CHEATER=0 still
  //      switched it ON, and every "real estimator" number ever recorded for
  //      this port was in fact a ground-truth run;
  //   2. after that was found and retracted in CLAUDE.md, the sweep harnesses
  //      went on hardcoding SIM_CHEATER=1 in their env block, and a whole 100 m
  //      dash table was measured and reported off the back of it.
  // A capability that is only safe when everyone remembers a rule is not safe.
  // Ground truth is still read for INSTRUMENTATION ONLY (see gazebo_get_truth /
  // SIM_ESTERR below) so estimator error can be quantified against it. Logging
  // truth is measurement; feeding truth to the controller is fiction.
  _robotParams.cheater_mode = 0;
  if (_backend == Backend::GAZEBO)
    shmtrace::logf(0.0, "[stm32mp1] REAL ESTIMATOR: VectorNav orientation + LinearKF"
           " (cheater mode does not exist)");
  _robotRunner->controlParameters = &_robotParams;
  _robotRunner->visualizationData = &_visualizationData;
  _robotRunner->cheetahMainVisualization = &_mainCheetahVisualization;

  // RS485 motor exchange (~500 Hz) and the control loop as separate periodic tasks,
  // sharing _spiData/_spiCommand (same lock-free pattern as the stock spiTask).
  PeriodicMemberFunction<Stm32mp1HardwareBridge> motorTask(
      &_taskManager, 0.002, "unitree-rs485",
      &Stm32mp1HardwareBridge::runMotors, this);
  motorTask.start();

  _robotRunner->start();

  // GAZEBO SITL has no operator/RC: auto-sequence the FSM control_mode so an FSM
  // controller (MIT_Controller) goes PASSIVE -> STAND_UP -> LOCOMOTION on its own.
  // Controllers that ignore control_mode (JPos/Stand) are unaffected. Override with
  // $SIM_MODE (final control_mode) / $SIM_STAND_S / $SIM_LOCO_S.
  if (_backend == Backend::GAZEBO) {
    std::thread([this]() {
      const char* m = getenv("SIM_MODE");
      int final_mode = m ? atoi(m) : 4;               // default: LOCOMOTION
      int t_stand = getenv("SIM_STAND_S") ? atoi(getenv("SIM_STAND_S")) : 4;
      int t_bal   = getenv("SIM_BAL_S")   ? atoi(getenv("SIM_BAL_S"))   : 8;
      int t_loco  = getenv("SIM_LOCO_S")  ? atoi(getenv("SIM_LOCO_S"))  : 14;
      // The z-collapse fall check (RobotRunner.cpp) latches "stood" the
      // FIRST time estimated body height crosses 0.25 m, specifically so a
      // robot that starts low (belly-down spawn) is not misread as
      // collapsed before it has ever stood - only once BODY HEIGHT has
      // proven a real stand does a later low reading mean a genuine
      // collapse. That assumes spawn height stays below 0.25 m, which is
      // true for the intended lying-down spawn but was measured to be
      // false for a time while investigating a taller one (see git history
      // around 2026-08-25) - a spawn tall enough to clear straight,
      // uncontrolled legs is itself ABOVE 0.25 m, which would arm the
      // check before the boot-limp phase even begins and read the natural
      // settle-under-gravity as an instant collapse. Suspended here for
      // the whole boot sequence (spawn through the FIRST genuine stand),
      // same mechanism the dash interlude already uses around its own
      // commanded lie-down/stand-up - re-armed the moment `final_mode` is
      // reached below, so mid-mission collapse detection is untouched.
      setFallZEnable(false);
      usleep(t_stand * 1000000);
      _robotParams.control_mode = 1;                  // K_STAND_UP
      shmtrace::logf(t_stand, "[sim] control_mode -> STAND_UP");
      if (final_mode != 1) {
        // Go THROUGH BALANCE_STAND (like MIT's operator flow): it lifts the body
        // from the ~0.20 m stand-up crouch to the 0.29 m locomotion height. Jumping
        // 1 -> 4 directly makes the MPC see a 9 cm height step and command ~2x
        // bodyweight stance forces (a leap) right as the gait starts.
        if (final_mode == 4 && !getenv("SIM_SKIP_BAL")) {
          usleep((t_bal - t_stand) * 1000000);
          _robotParams.control_mode = 3;              // K_BALANCE_STAND
          shmtrace::logf(t_bal, "[sim] control_mode -> BALANCE_STAND");
          usleep((t_loco - t_bal) * 1000000);
        } else {
          usleep((t_loco - t_stand) * 1000000);
        }
        _robotParams.control_mode = final_mode;       // K_LOCOMOTION (4) etc.
        shmtrace::logf(t_loco, "[sim] control_mode -> %d", final_mode);
        // Genuinely standing now (STAND_UP -> BALANCE_STAND -> final_mode
        // all completed) - re-arm the z-collapse check for the rest of the
        // mission. See the comment above the matching setFallZEnable(false).
        setFallZEnable(true);
        // After the trot stabilizes, RAMP in the forward velocity (a 0 -> vx step
        // through the ~6-10 ms UDP loop knocked the trot over; ramping does not).
        // $SIM_VX target speed, $SIM_VX_RAMP_S ramp duration (default 3 s).
        // $SIM_WZ adds a YAW RATE command on the same schedule, so the robot can
        // be asked to turn while moving (cornering) or to spin in place with
        // zero forward velocity (a pirouette). Both channels ramp together: a
        // stepped yaw command knocks the gait over for the same reason a stepped
        // velocity command does.
        //
        // SIGN, and why this is NEGATED - the full chain, measured end to end:
        //   SIM_WZ -> rightStickAnalog[0] -> DesiredStateCommand.cpp does
        //   `joystickRight[0] *= -1` (UPSTREAM MIT, and correct: pushing a
        //   gamepad's right stick RIGHT should turn the robot RIGHT) ->
        //   rightAnalogStick[0] -> _yaw_turn_rate, which is CCW-POSITIVE.
        // So a raw stick value and the yaw rate it produces have OPPOSITE signs.
        // Passing SIM_WZ straight through meant `SIM_WZ=+1.0` printed as
        // `wzCmd=-1.000` in the logs and turned the robot clockwise, which cost
        // a full investigation chasing a "sign bug" that did not exist.
        // SIM_WZ is therefore defined as a YAW RATE in rad/s, CCW-positive -
        // the same convention as _yaw_turn_rate and as the [YAW]/[YAWREF] logs -
        // and it is negated HERE, once, to become a stick deflection.
        // VERIFIED not a controller bug: with SIM_WZ=1.0 the reference and the
        // measurement track each other with a CONSTANT 0.21 rad offset through
        // a full revolution and across the +-pi wrap - a healthy rate loop with
        // a steady-state offset, not a divergence.
        const bool haveVx = getenv("SIM_VX") && atof(getenv("SIM_VX")) != 0.0;
        const bool haveWz = getenv("SIM_WZ") && atof(getenv("SIM_WZ")) != 0.0;
        /*
         * $WP_MISSION SKIPS THIS WHOLE RAMP. Without this guard, the sequence
         * below drives the stick straight ahead (zero yaw) for delay_s + 3 s
         * + ramp_s - with the Conductor's own defaults (4 + 3 + 8 = 15 s) that
         * is a genuine multi-metre straight-line overshoot BEFORE navThread's
         * wait condition (stick >= 99% of vx) is ever satisfied, because that
         * condition is exactly what this block spends 15 s working toward.
         * Measured: it shows up as a straight bisecting line through the
         * atom's rosette, since the mission's own curve starts turning
         * immediately while this ramp keeps the dog going dead straight.
         * navThread takes the stick itself instead (see its own settle wait)
         * the moment LOCOMOTION engages, so mode sequencing above still runs
         * unchanged - only the STRAIGHT velocity ramp is what a mission
         * pre-empts, because steering from the first tick is the entire point
         * of having a mission at all.
         */
        if (final_mode == 4 && (haveVx || haveWz) && !getenv("WP_MISSION")) {
          // Let the gait ENGAGE before asking it to go anywhere. The MPC port
          // holds MIT's standing gait for a short window after LOCOMOTION
          // entry (first async solution + settle), so a velocity ramp that
          // starts at mode-4 is already at 0.2-0.3 m/s when the trot actually
          // begins - and the first strides lunge (measured: 21 cm surge,
          // +23 deg pitch, roll-over). Real operators do the same thing with
          // the stick: stand, trot in place, then push forward.
          float delay_s = getenv("SIM_VX_DELAY_S") ? atof(getenv("SIM_VX_DELAY_S")) : 3.f;
          shmtrace::logf(t_loco, "[sim] holding velocity at 0 for %.1f s while the gait engages", delay_s);
          usleep((useconds_t)(delay_s * 1e6f));
          usleep(3000000);
          float vx = haveVx ? atof(getenv("SIM_VX")) : 0.f;
          float wz = haveWz ? atof(getenv("SIM_WZ")) : 0.f;
          float ramp_s = getenv("SIM_VX_RAMP_S") ? atof(getenv("SIM_VX_RAMP_S")) : 3.f;
          shmtrace::logf(t_loco + delay_s + 3.0, "[sim] ramping vx -> %.2f m/s, wz -> %.2f rad/s over %.1f s",
                 vx, wz, ramp_s);
          const int steps = (int)(ramp_s * 10.f);
          for (int s = 1; s <= steps; ++s) {
            _gamepadCommand.leftStickAnalog[1]  =  vx * s / steps;
            _gamepadCommand.rightStickAnalog[0] = -wz * s / steps;   // see note
            usleep(100000);
          }
          _gamepadCommand.leftStickAnalog[1]  =  vx;
          _gamepadCommand.rightStickAnalog[0] = -wz;
          shmtrace::logf(t_loco + delay_s + 3.0 + ramp_s, "[sim] command -> vx=%.2f m/s wz=%.2f rad/s", vx, wz);

          // $SIM_PROFILE: drive SPEED and GAIT changes DURING a run, to test
          // that the parameter scheduler transitions seamlessly rather than
          // stepping a running gait. Format "t:vx:gait;t:vx:gait;..." with t in
          // seconds from the end of the ramp; gait <0 leaves the gait alone.
          // Speed is ramped between steps (a stepped velocity knocks the gait
          // over, which would test the step and not the scheduler); the gait
          // switch itself is instantaneous because that is what an operator or
          // a planner actually does.
          // NOTE: do NOT set SIM_GAIT for profile runs - it is read once into a
          // static and would pin the gait, masking every switch.
          if (const char* prof = getenv("SIM_PROFILE")) {
            std::string s(prof);
            size_t pos = 0;
            float tPrev = 0.f, vPrev = vx;
            while (pos < s.size()) {
              size_t end = s.find(';', pos);
              if (end == std::string::npos) end = s.size();
              float tt = 0, vv = 0; int gg = -1;
              if (sscanf(s.substr(pos, end - pos).c_str(), "%f:%f:%d", &tt, &vv, &gg) >= 2) {
                float wait = tt - tPrev;
                if (wait > 0) usleep((useconds_t)(wait * 1e6f));
                if (gg >= 0 && _userControlParameters) {
                  ControlParameterValue cv; cv.d = (double)gg;
                  _userControlParameters->collection.lookup("cmpc_gait")
                      .set(cv, ControlParameterValueKind::DOUBLE);
                  shmtrace::logf(tt, "[profile] t=%.1fs GAIT -> %d", tt, gg);
                }
                // ramp the speed over 2 s so the scheduler, not a step, is what
                // is under test
                const int st = 20;
                for (int k = 1; k <= st; ++k) {
                  _gamepadCommand.leftStickAnalog[1] = vPrev + (vv - vPrev) * k / st;
                  usleep(100000);
                }
                _gamepadCommand.leftStickAnalog[1] = vv;
                shmtrace::logf(tt, "[profile] t=%.1fs vx -> %.2f", tt, vv);
                vPrev = vv; tPrev = tt + 2.f;
              }
              pos = end + 1;
            }
          }
        }
      } else {
        // $SIM_MODE=1 (debug: stop the sequencer at STAND_UP, never reach
        // BALANCE_STAND/LOCOMOTION) - the re-arm above is inside the
        // final_mode != 1 branch and would never run, so do it here
        // instead. Otherwise the z-collapse check stays disabled for the
        // rest of the process, silently, in a rarely-used debug path.
        setFallZEnable(true);
      }
    }).detach();
  }

