MAVProxyUser/MITCheetahSTM31MP1-Claude/robot/src/Stm32mp1HardwareBridge.cpp
  // SELF-IDENTIFYING LOGS. $SIM_RUN_ID/$SIM_INSTANCE were already passed to
  // every controller process (server.py's launch command line) but never
  // actually READ by this binary - meaning no ctrl log line, anywhere in
  // the file, ever said which run produced it. That is a real, repeatedly-
  // costly gap: a stale process's tail landing in a fresh run's freshly-
  // truncated log (the async-teardown race, and separately an unsafe manual
  // server restart, both documented in CLAUDE.md) produced garbled,
  // misattributed content that took real debugging effort to recognize as
  // contamination rather than a code regression, MULTIPLE times in one
  // session - and every time, the only way to tell was indirect (comparing
  // waypoint coordinates against a DIFFERENT mission, or noticing an
  // impossible timestamp gap), never a direct check of the data itself.
  // Stamping [RUNID] onto the SAME once-a-second line every ctrl log
  // already carries means any tool (or person) reading ANY point in a log
  // - not just its first line, which a contaminated tail may have
  // overwritten differently than its middle - can directly verify which
  // run they are actually looking at, rather than trusting a filename or a
  // timing assumption.
  const int simRunId = getenv("SIM_RUN_ID") ? atoi(getenv("SIM_RUN_ID")) : -1;
  const int simInst   = getenv("SIM_INSTANCE") ? atoi(getenv("SIM_INSTANCE")) : 0;
  double _healthElapsed = 0.0;   // this loop's own clock - see ShmTrace.h's note
  for (;;) {
    usleep(1000000);
    _healthElapsed += 1.0;
    if (_robotRunner) {
      shmtrace::logf(_healthElapsed, "[stm32mp1] ctrl loop: maxRuntime=%.2f ms  maxPeriod=%.2f ms  (period target %.1f ms)  [RUNID] run=%d instance=%d",
             _robotRunner->getMaxRuntime() * 1000.f,
             _robotRunner->getMaxPeriod() * 1000.f,
             _robotParams.controller_dt * 1000.f,
             simRunId, simInst);
      _robotRunner->clearMax();
      // The MOTOR task is a separate thread and the control loop's numbers say
      // nothing about it: the sim bridge saw the command stream freeze for
      // 33-45 ms about once a second (OPEN-28's initiator) with the control
      // loop at 2.5 ms throughout. This line is the sender's own period.
      shmtrace::logf(_healthElapsed, "[stm32mp1] motor task: maxRuntime=%.2f ms  maxPeriod=%.2f ms",
             motorTask.getMaxRuntime() * 1000.f, motorTask.getMaxPeriod() * 1000.f);
      motorTask.clearMax();
      // OPEN-31: how often the operational joint range bound this second
      // (joint-PD targets clamped / soft stops applied, summed over 12 joints)
      shmtrace::logf(_healthElapsed, "[stm32mp1] joint limits: clamps=%ld stops=%ld",
             g_jointLimitClamps.exchange(0), g_jointLimitStops.exchange(0));
      // OPEN-39: held sensor samples as locomotionSafe() sees them. `held` is
      // (leg,tick) pairs whose state was bit-identical to the previous tick -
      // routine at matched rates - and `maxrun` is the longest consecutive
      // hold for one leg this second, which is the number that matters: a run
      // of 5+ is long enough to have forged a "persistent" violation.
      shmtrace::logf(_healthElapsed, "[stm32mp1] held samples: held=%ld/s maxrun=%ld  leg_y_max=%ld mm",
             g_legHeldTicks.exchange(0), g_legHeldMaxRun.exchange(0), g_legYMaxMm.exchange(0));
    }
  }
}

  // linux
